app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Andy"], ["last_name", "Banana"], ["created_at", "2019-02-25 21:37:03.124809"], ["updated_at", "2019-02-25 21:37:03.124809"]]
---
    def create
        @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-02-25 21:42:42.514343"], ["id", 1]]
---
    def update

        @student.update(student_params)